IDEA Open Model
BoltParam.BoltInteraction Property
Compatible with IDEA StatiCa Beta 20.0
 Indicates type of shear transfer
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public BoltShearType BoltInteraction { get; set; }
Public Property BoltInteraction As BoltShearType
	Get
	Set
Property Value
Type: BoltShearType
See Also
Reference
BoltParam Class
IdeaRS.OpenModel.Parameters Namespace